Revit 2024 API
BuiltInFailures.RebarFailures.StandardHookBendDiameterTooSmall Property
 Rebar Standard Hook Bend Diameter is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StandardHookBendDiameterTooSmall { get; }
Visual Basic
Public Shared ReadOnly Property StandardHookBendDiameterTooSmall As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StandardHookBendDiameterTooSmall {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace